#include "regx52.h"
#include "delay.h"
#include "key.h"
#include "Nixie.h"
#include "Buzzer.h"
#include "Timer0.h"

sbit Buzzer = P2 ^ 5;//蜂鸣器的端口是P2_5
#define SPEED_SALIYA 108//萨莉亚，是以108为基准时长的
#define SPEED_DAYU 200//大鱼200ms为基准时常

unsigned char FreqSelect, MusicSelect;

unsigned int FreqTable[] = {0,
    63628,63731,63835,63928,64021,64103,64185,
    64260,64331,64400,64463,64528,64580,64633,
    64684,64732,64777,64820,64860,64898,64934,
    64968,65000,65030,65058,65085,65110,65134,
    65157,65178,65198,65217,65235,65252,65268,65283
};
unsigned char code  Music_Saliya[] = {
    //406070
    6 , 1,
    0 , 1,
    10, 1,
    0 , 1,
    12, 2,
    0 , 2,
    //406070
    6 ,1,
    0 ,1,
    10,1,
    0 ,1,
    12,2,
    0 ,2,
    //40607030
    6 ,1,
    0 ,1,
    10,1,
    0 ,1,
    12,1,
    0 ,1,
    5 ,1,
    0 ,1,
    //207010
    15,2,
    0 ,2,
    12,1,
    0 ,1,
    1 ,1,
    0 ,1,
    //70503-
    12,1,
    0,1,
    8,1,
    0,1,
    5,8,
    //020
    0,2,
    3,1,
    0,1,
    //30503-0
    5,1,
    0,1,
    8,1,
    0,1,
    5,8,
    0,4,



    //406070
    6 , 1,
    0 , 1,
    10, 1,
    0 , 1,
    12, 2,
    0 , 2,
    //406070
    6 ,1,
    0 ,1,
    10,1,
    0 ,1,
    12,2,
    0 ,2,
    //40607030
    6 ,1,
    0 ,1,
    10,1,
    0 ,1,
    12,1,
    0 ,1,
    5 ,1,
    0 ,1,
    //207010
    15,2,
    0 ,2,
    12,1,
    0 ,1,
    1 ,1,
    0 ,1,
    //30705-
    17,1,
    0 ,1,
    12,1,
    0 ,1,
    8 ,8,
    //010
    0 ,2,
    13,1,
    0 ,1,
    //50203-0
    8 ,1,
    0 ,1,
    3 ,1,
    0 ,1,
    5 ,8,
    0 ,4,
    // //203040
    // 3 ,1,
    // 0 ,1,
    // 5 ,1,
    // 0 ,1,
    // 6 ,2,
    // 0, 2,
    //506070
    8 ,1,
    0 ,1,
    10,1,
    0 ,1,
    12,2,
    0, 2,
    //10703-0
    13,1,
    0 ,1,
    12,1,
    0 ,1,
    5 ,8,
    0 ,4,

    //203040
    3 ,1,
    0 ,1,
    5 ,1,
    0 ,1,
    6 ,2,
    0, 2,
    //506070
    8 ,1,
    0 ,1,
    10,1,
    0 ,1,
    12,2,
    0, 2,
    //10203-0
    13,1,
    0 ,1,
    15,1,
    0 ,1,
    17,8,
    0, 4,

    //203040
    3 ,1,
    0 ,1,
    5 ,1,
    0 ,1,
    6 ,2,
    0, 2,
    //506070
    8 ,1,
    0 ,1,
    10,1,
    0 ,1,
    12,2,
    0, 2,
    //10703-0
    13,1,
    0 ,1,
    12,1,
    0 ,1,
    5 ,8,
    0, 4,

    //3020
    5,1,
    0,1,
    3,1,
    0,1,
    //4030
    6,1,
    0,1,
    5,1,
    0,1,
    //5040
    8,1,
    0,1,
    6,1,
    0,1,
    //6050
    10,1,
    0 ,1,
    8 ,1,
    0 ,1,
    //7060
    12,1,
    0 ,1,
    10,1,
    0 ,1,
    //1070
    13,1,
    0 ,1,
    12,1,
    0 ,1,
    //2010
    15,1,
    0 ,1,
    13,1,
    0 ,1,
    //3402
    17,1,
    18,1,
    0 ,1,
    15,1,
    //3---
    17, 16,
    0xff

};

unsigned char code Music_Dayu[] = {
    //61122336
    10,2,
    13,2,
    13,2,
    15,2,
    15,2,
    17,2,
    17,2,
    22,2,

    //532
    20,6,
    17,2,
    15,8,
    0xff,
};
/**
  * @brief: 如果乐谱里面取出来的音符是0XFF那就关闭定时器；如果不是0XFF就把音乐乐谱里面取出来的值赋值给freqselect。这样， FreqSelect就能拿着这个值去音符数组里面挑音符了，然后等到定时器中断来的时候，就可以拿着这个音符去响频率了。
等到一个音符时长，比如说108毫秒，消耗完之后，就可以关4毫秒的定时器，让两个音符之间有停顿感。接着继续把歌谱里面的索引值加一，然后把这个值传给音符索引，去音符集里面挑音符

  * @param:无
  * @retval:无
  */
void main()
{
    Timer0Init();
    while (1)
    {
        if (Music_Saliya[MusicSelect] == 0xff)
        {
            TR0 = 0;
        }
        else
        {
            FreqSelect = Music_Saliya[MusicSelect];
            MusicSelect++;
            Delay(SPEED_SALIYA*Music_Saliya[MusicSelect]);//四分音符较多所以把萨莉亚的基准时长定为了108毫秒
            TR0 = 0;//关闭定时器4毫秒之后再打开定时器这样两个音符之间就会有停顿感
            Delay(4);
            TR0 = 1;
            MusicSelect++;
        }
            
    }
}
/**
  * @brief: 定时器的周期：每freqtable ［freak select来一次中断，比如说这个值是64535的话，就是1ms一次，也就是每2ms，蜂鸣器响一下。
    此时主程序还在执行delay（SPEED _SALIYA * Music_Saliya［Mjsic_Select ]音符时长呢，这个时长最少也是108毫秒。所以中断里面的Freqselect这个值还不会变。
  * @param:无
  * @retval:无
  */
void Timer0_Rountine() interrupt 1
{
    if (FreqTable[FreqSelect])
    {
        TH0 = FreqTable[FreqSelect] / 256;
        TL0 = FreqTable[FreqSelect] % 256;
        Buzzer = !Buzzer;
    }
        
}